# BoundaryRestraintRotX Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BoundaryRestraintRotX Property
ParameterTypeId Class See Also
---
"X Spring Modulus"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BoundaryRestraintRotX { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryRestraintRotX As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BoundaryRestraintRotX {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace